tap "ameshkov/tap"
tap "anchore/grype"
tap "aurc/loggo"
tap "aws/tap"
tap "axodotdev/tap"
tap "bellicose100xp/tap"
tap "common-fate/granted"
tap "cyclonedx/cyclonedx"
tap "dlvhdr/formulae"
tap "f1bonacc1/tap"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homeport/tap"
tap "jackielii/tap"
tap "kaushiksrini/parqeye"
tap "llimllib/git-ls"
tap "llimllib/tap"
tap "lucaspickering/tap"
tap "murdercode/presto"
tap "mutagen-io/mutagen"
tap "nikitabobko/tap"
tap "omad/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "rishikanthc/scriberr"
tap "siddhantac/puffin"
tap "sourcemeta/apps"
tap "terror/tap"
tap "robusta-dev/homebrew-krr"
tap "wader/tap"
tap "ycd/tap"
brew "argo"
brew "helm"
brew "actionlint"
brew "krr"
brew "alexjs"
brew "allure"
brew "webp"
brew "apktool"
brew "aspell"
brew "atuin"
brew "austin"
brew "boost"
brew "azure-cli"
brew "bash"
brew "bat-extras"
brew "beancount-language-server"
brew "bento4"
brew "bison"
brew "boxes"
brew "cargo-binstall"
brew "cdebug"
brew "cloudflared"
brew "cmake-language-server"
brew "codebook-lsp"
brew "curl"
brew "composer"
brew "coreutils"
brew "cosign"
brew "crane"
brew "csvlens"
brew "csvtk"
brew "cypher-shell"
brew "d2"
brew "delve"
brew "deno"
brew "dependabot"
brew "devcontainer"
brew "difftastic"
brew "docker-language-server"
brew "dockerfile-language-server"
brew "doggo"
brew "duckdb"
brew "eget"
brew "esphome"
brew "esptool"
brew "evernote2md"
brew "exiftool"
brew "expect"
brew "eza"
brew "ffmpeg"
brew "ffmpeg@7"
brew "figlet"
brew "fio"
brew "fish"
brew "fish-lsp"
brew "fnm"
brew "fnox"
brew "fx"
brew "gawk"
brew "geos"
brew "libomp"
brew "poppler"
brew "gdal"
brew "ghostscript"
brew "gitleaks"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "go-task"
brew "golangci-lint"
brew "gonzo"
brew "gopls"
brew "gpac"
brew "gping"
brew "grafana-alloy"
brew "graphviz"
brew "gron"
brew "grype"
brew "gum"
brew "haskell-stack"
brew "headson"
brew "helm-ls"
brew "hexyl"
brew "hledger"
brew "hwatch"
brew "imagemagick"
brew "jadx"
brew "jjui"
brew "jq-lsp"
brew "jwt-cli"
brew "kanata"
brew "kanata-tray"
brew "kubetail"
brew "kubefwd"
brew "kyverno"
brew "lazyjournal"
brew "lilypond"
brew "llvm"
brew "lld"
brew "lnav"
brew "lsd"
brew "lynx"
brew "markdownlint-cli"
brew "marksman"
brew "mas"
brew "mcat"
brew "media-info"
brew "mergiraf"
brew "mimirtool"
brew "mise"
brew "yt-dlp", args: ["HEAD"]
brew "mpv"
brew "mqttui"
brew "navi"
brew "nethogs"
brew "nmap"
brew "nrg2iso"
brew "numbat"
brew "nushell"
brew "oils-for-unix"
brew "openapi-generator"
brew "oras"
brew "ouch"
brew "pandoc"
brew "patchutils"
brew "pgcopydb"
brew "pgweb"
brew "picat"
brew "pixi"
brew "playwright-mcp"
brew "pngpaste"
brew "portaudio"
brew "postgresql@14"
brew "postgresql@16"
brew "postgresql@17"
brew "procs"
brew "pstree"
brew "qalculate-qt"
brew "qemu"
brew "qsv"
brew "rainfrog"
brew "rdap"
brew "regclient"
brew "resvg"
brew "ripgrep-all"
brew "s5cmd"
brew "scooter"
brew "scrcpy"
brew "sd"
brew "sevenzip"
brew "socat"
brew "stern"
brew "stu"
brew "syft"
brew "tanka"
brew "tealdeer"
brew "tfstate-lookup"
brew "tidy-viewer"
brew "tmux"
brew "topgrade"
brew "transmission-cli"
brew "tree"
brew "tree-sitter-cli"
brew "typos-cli"
brew "typst"
brew "viddy"
brew "w3m"
brew "watch"
brew "weasyprint"
brew "wget"
brew "yadm"
brew "yamlfmt"
brew "yazi"
brew "zellij"
brew "zig"
brew "zizmor"
brew "ameshkov/tap/dnslookup"
brew "aurc/loggo/loggo"
brew "aws/tap/eks-node-viewer"
brew "axodotdev/tap/cargo-dist"
brew "bellicose100xp/tap/jiq"
brew "common-fate/granted/granted"
brew "cyclonedx/cyclonedx/cyclonedx-cli"
brew "dlvhdr/formulae/diffnav"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "homeport/tap/dyff"
brew "jackielii/tap/skhd-zig"
brew "kaushiksrini/parqeye/parqeye"
brew "llimllib/git-ls/git-ls"
brew "lucaspickering/tap/slumber"
brew "mutagen-io/mutagen/mutagen"
brew "qmk/qmk/qmk"
brew "siddhantac/puffin/puffin"
brew "terror/tap/just-lsp"
brew "wader/tap/fq"
brew "ycd/tap/dstp"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "alfred"
cask "android-platform-tools"
cask "anki"
cask "audacity"
cask "llimllib/tap/aver"
cask "blender"
cask "calibre"
cask "cap"
cask "cocoapacketanalyzer"
cask "codex"
cask "font-jetbrains-mono-nerd-font"
cask "font-libertinus-sans"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "freecad"
cask "git-credential-manager"
cask "gitify"
cask "godot"
cask "google-earth-pro"
cask "hammerspoon"
cask "handbrake-app"
cask "headlamp"
cask "iina"
cask "imhex"
cask "inkscape"
cask "jellyfin-media-player"
cask "jordanbaird-ice"
cask "sourcemeta/apps/jsonschema"
cask "jupyterlab-app"
cask "kap"
cask "kitty"
cask "kopiaui"
cask "lens"
cask "lm-studio"
cask "logitech-camera-settings"
cask "logitech-options"
cask "losslesscut"
cask "lulu"
cask "maccy"
cask "macdown-3000"
cask "macdroid"
cask "meld"
cask "mitmproxy"
cask "mqttx"
cask "neo4j-desktop"
cask "neovide-app"
cask "netiquette"
cask "notunes"
cask "obs"
cask "openmtp"
cask "pgadmin4"
cask "murdercode/presto/presto"
cask "pycharm"
cask "qmk-toolbox"
cask "rclone-ui"
cask "rustdesk"
cask "skim"
cask "stats"
cask "todoist-app"
cask "vlc"
cask "vmware-fusion"
cask "wezterm@nightly"
cask "zen"
mas "1Password for Safari", id: 1569813296
mas "Amperfy", id: 1530145038
mas "Finer", id: 6738301953
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Voice Type", id: 6736525125
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "charliermarsh.ruff"
vscode "chrisjsewell.myst-tml-syntax"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "hashicorp.terraform"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "swyddfa.esbonio"
vscode "tim-koehler.helm-intellisense"
vscode "trond-snekvik.simple-rst"
vscode "visualjj.visualjj"
vscode "vscodevim.vim"
go "github.com/ayoisaiah/f2/v2/cmd/f2"
go "github.com/nametake/golangci-lint-langserver"
go "golang.org/x/tools/gopls"
go "github.com/x-motemen/gore/cmd/gore"
go "github.com/idursun/jjui/cmd/jjui"
cargo "apk-info-cli"
cargo "cargo-cache"
cargo "cargo-edit"
cargo "cargo-update"
cargo "commit-lsp"
cargo "ddv"
cargo "diffedit3"
cargo "heh"
cargo "jj-cli"
cargo "lazyjj"
cargo "mdns-scanner"
cargo "mdriver"
cargo "pipr"
cargo "rustac"
cargo "tatuin"
cargo "uv-migrator"
uv "argcomplete"
uv "atuin-history-browser"
uv "austin-python"
uv "austin-tui"
uv "basedpyright"
uv "datasette"
uv "eks-rolling-update"
uv "eodag"
uv "esbonio", with: ["rstcheck"]
uv "files-to-prompt"
uv "flux-local", with: ["tabulate"]
uv "frida-tools"
uv "gita"
uv "harlequin"
uv "hatch"
uv "homeassistant-cli"
uv "ipython"
uv "jterm"
uv "jupyter-core"
uv "jupyterlab", with: ["jupyter"]
uv "juv"
uv "keyring"
uv "llm", with: ["llm-anthropic", "llm-deepseek", "llm-fragments-github", "llm-fragments-site-text", "llm-gemini", "llm-github-copilot", "llm-github-models", "llm-openrouter"]
uv "marimo[recommended]", with: ["matplotlib", "numpy"]
uv "nbpreview"
uv "objection"
uv "posting"
uv "pre-commit"
uv "prek"
uv "py-spy"
uv "pygments"
uv "pylint"
uv "pystac-client"
uv "python-lsp-server", with: ["pylsp-mypy", "pylsp-rope", "python-lsp-black", "python-lsp-isort", "python-lsp-ruff"]
uv "rich-cli"
uv "rodney"
uv "rstcheck[sphinx,toml]"
uv "ruff"
uv "rumdl"
uv "sphinx-lint"
uv "sqlit-tui"
uv "sqlite-utils"
uv "strip-tags"
uv "symbex"
uv "tinytuya"
uv "tombi"
uv "toolong"
uv "tox", with: ["tox-uv"]
uv "validate-pyproject[all]"
uv "visidata"
uv "wtfis"
uv "zuban"
brew "qman"
brew "scc"
brew "ast-grep"
brew "witr"
brew "mole"
brew "pug"
brew "grafanactl"
brew "grizzly" # Old Grafana CLI
brew "runme"
brew "telnet"
brew "grc"
brew "thaw"
brew "db-browser-for-sqlite"
tap "kdash-rs/kdash"
brew "kdash"
brew "xan"  # CLI CSV Toolkit
brew "jsonnet"

# Process managers, a-la docker-compose without docker
brew "mprocs"
brew "tilt"
brew "f1bonacc1/tap/process-compose"

# Better Whois Tool (TUI)
brew install "retlehs/tap/quien"

# Investigate:
# orchard: Native GUI for Apple Containers
# paper-design: Design tool for creating interfaces and prototypes
# rockxy-community: HTTP proxy
# tablen: Native SQL client
# worksheet-crafter: Worksheet and lesson material creator
