tap "anchore/grype"
tap "aurc/loggo"
tap "aws/tap"
tap "axodotdev/tap"
tap "common-fate/granted"
tap "cyclonedx/cyclonedx"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "mutagen-io/mutagen"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "siddhantac/puffin"
tap "sourcemeta/apps"
tap "ycd/tap"
brew "actionlint"
brew "allure"
brew "webp"
brew "llvm"
brew "apktool"
brew "aspell"
brew "austin"
brew "boost"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bento4"
brew "block-goose-cli"
brew "cargo-binstall"
brew "cdebug"
brew "cloudflared"
brew "curl"
brew "composer"
brew "coreutils"
brew "cosign"
brew "crane"
brew "csvtk"
brew "deno"
brew "dependabot"
brew "devcontainer"
brew "difftastic"
brew "doggo"
brew "duckdb"
brew "eget"
brew "esphome"
brew "esptool"
brew "expect"
brew "eza"
brew "f2"
brew "ffmpeg"
brew "ffmpeg@7"
brew "fio"
brew "fish"
brew "fnm"
brew "fx"
brew "geos"
brew "poppler"
brew "gdal"
brew "ghostscript"
brew "gitleaks"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "gpac"
brew "graphviz"
brew "grype"
brew "gum"
brew "haskell-stack"
brew "hexyl"
brew "hledger"
brew "hwatch"
brew "libomp"
brew "imagemagick"
brew "jadx"
brew "lilypond"
brew "lld"
brew "lnav"
brew "lsd"
brew "lynx"
brew "mas"
brew "mcat"
brew "mergiraf"
brew "mise"
brew "mqttui"
brew "navi"
brew "nethogs"
brew "nmap"
brew "nrg2iso"
brew "numbat"
brew "oils-for-unix"
brew "oras"
brew "pandoc"
brew "patchutils"
brew "pgcopydb"
brew "pgweb"
brew "picat"
brew "pixi"
brew "playwright-mcp"
brew "pngpaste"
brew "portaudio"
brew "postgresql@14"
brew "postgresql@16"
brew "postgresql@17"
brew "procs"
brew "pstree"
brew "qalculate-qt"
brew "qemu"
brew "qsv"
brew "rdap"
brew "regclient"
brew "resvg"
brew "ripgrep-all"
brew "s5cmd"
brew "scooter"
brew "scrcpy"
brew "sd"
brew "sevenzip"
brew "socat"
brew "syft"
brew "tanka"
brew "tealdeer"
brew "topgrade"
brew "typos-cli"
brew "typst"
brew "viddy"
brew "w3m"
brew "watch"
brew "weasyprint"
brew "wget"
brew "x-cmd"
brew "yadm"
brew "yamlfmt"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zig"
brew "zizmor"
brew "aurc/loggo/loggo"
brew "aws/tap/eks-node-viewer"
brew "axodotdev/tap/cargo-dist"
brew "common-fate/granted/granted"
brew "cyclonedx/cyclonedx/cyclonedx-cli"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "mutagen-io/mutagen/mutagen"
brew "qmk/qmk/qmk"
brew "siddhantac/puffin/puffin"
brew "ycd/tap/dstp"
cask "1password-cli"
cask "alfred"
cask "android-platform-tools"
cask "anki"
cask "audacity"
cask "blender"
cask "block-goose"
cask "calibre"
cask "cap"
cask "codex"
cask "font-libertinus-sans"
cask "freecad"
cask "git-credential-manager"
cask "godot"
cask "google-earth-pro"
cask "hammerspoon"
cask "handbrake-app"
cask "iina"
cask "imhex"
cask "inkscape"
cask "jellyfin-media-player"
cask "jordanbaird-ice"
cask "jsonschema"
cask "jupyterlab-app"
cask "kap"
cask "kopiaui"
cask "lens"
cask "lm-studio"
cask "logitech-camera-settings"
cask "logitech-options"
cask "losslesscut"
cask "macdroid"
cask "meld"
cask "mitmproxy"
cask "mqttx"
cask "neovide-app"
cask "notunes"
cask "obs"
cask "openmtp"
cask "opensuperwhisper"
cask "pgadmin4"
cask "pycharm"
cask "qmk-toolbox"
cask "rustdesk"
cask "stats"
cask "todoist-app"
cask "vlc"
cask "vmware-fusion"
cask "wezterm@nightly"
cask "wireshark-app"
mas "1Password for Safari", id: 1569813296
mas "Amperfy", id: 1530145038
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Manet", id: 6470928235
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Voice Type", id: 6736525125
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "charliermarsh.ruff"
vscode "chrisjsewell.myst-tml-syntax"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "google.geminicodeassist"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "openai.chatgpt"
vscode "swyddfa.esbonio"
vscode "trond-snekvik.simple-rst"
vscode "visualjj.visualjj"
vscode "vscodevim.vim"
go "github.com/idursun/jjui/cmd/jjui"
