tap "axodotdev/tap"
tap "common-fate/granted"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "ycd/tap"
brew "actionlint"
brew "llvm"
brew "apktool"
brew "aspell"
brew "austin"
brew "azure-cli"
brew "bat"
brew "cargo-binstall"
brew "deno"
brew "dependabot"
brew "duckdb"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "gdal"
brew "ghostscript"
brew "graphviz"
brew "haskell-stack"
brew "hledger"
brew "jadx"
brew "lilypond"
brew "lld"
brew "lsd"
brew "lynx"
brew "mas"
brew "nmap"
brew "numbat"
brew "oils-for-unix"
brew "pandoc"
brew "portaudio"
brew "postgresql@16"
brew "postgresql@17"
brew "qalculate-qt"
brew "qemu"
brew "rdap"
brew "topgrade"
brew "typst"
brew "viddy"
brew "w3m"
brew "yadm"
brew "zig"
brew "zizmor"
brew "axodotdev/tap/cargo-dist"
brew "common-fate/granted/granted"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "ycd/tap/dstp"
cask "1password-cli"
cask "anki"
cask "calibre"
cask "finch"
cask "git-credential-manager"
cask "imhex"
cask "inkscape"
cask "jordanbaird-ice"
cask "kopiaui"
cask "lens"
cask "obs"
cask "stats"
cask "vlc"
cask "wireshark"
mas "1Password for Safari", id: 1569813296
mas "Amperfy", id: 1530145038
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Voice Type", id: 6736525125
mas "Xcode", id: 497799835
brew "rga"
brew "poppler"
