jorgebucaran/nvm.fish
PatrickF1/fzf.fish
evanlucas/fish-kubectl-completions
oh-my-fish/plugin-foreign-env
brgmnn/fish-docker-compose
jethrokuan/z
decors/fish-ghq
jorgebucaran/autopair.fish
jhillyerd/plugin-git
